minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32S3_CAM_MQTT1883/VisionBot_ESP32S3_CAM_MQTT1883.ino
String getHttpBase() {
  return "http://" + getIpString();
}

String getStreamUrl() {
  return "ws://" + getIpString() + ":86/";
}

String mqttTopic(const String &suffix) {
  return cfg.baseTopic + "/" + deviceId + "/" + suffix;
}

long currentUnixTs() {
  time_t now;
  time(&now);
  if (now < 1700000000) return 0; // not synced
  return (long)now;
}

void generateDeviceId() {
  uint64_t mac = ESP.getEfuseMac();
  uint32_t last24 = (uint32_t)(mac & 0xFFFFFF);

  char buf[24];
  snprintf(buf, sizeof(buf), "VB-CAM-%06X", last24);
  deviceId = String(buf);

  char apBuf[32];
  snprintf(apBuf, sizeof(apBuf), "VisionBot-%06X", last24);
  setupApSsid = String(apBuf);
}

String generateRandomSetupPassword() {
  const char alphabet[] = "ABCDEFGHJKLMNPQRSTUVWXYZ23456789";
  String pass = "VB-";
  for (int i = 0; i < 10; i++) {
    uint32_t r = esp_random();
    pass += alphabet[r % (sizeof(alphabet) - 1)];
  }
  return pass;
}

void ensureSetupPassword() {
  prefs.begin("visionbot", false);
  setupApPass = prefs.getString("setup_pass", "");
  if (setupApPass.length() < 8) {
    setupApPass = generateRandomSetupPassword();
    prefs.putString("setup_pass", setupApPass);
  }
  prefs.end();
}

// ================= MOTOR =================
void motorStop() {
  digitalWrite(IN1, LOW);
  digitalWrite(IN2, LOW);
  digitalWrite(IN3, LOW);
  digitalWrite(IN4, LOW);

  motorActive = false;
  motorState = "stop";
}

void motorForward() {
  if (currentMode == MODE_ESTOP) {
    motorStop();
    return;
  }

  digitalWrite(IN1, HIGH);
  digitalWrite(IN2, LOW);
  digitalWrite(IN3, HIGH);
  digitalWrite(IN4, LOW);

  lastMotorCommandMs = millis();
  motorActive = true;
  motorState = "forward";
}

void motorBackward() {
  if (currentMode == MODE_ESTOP) {
    motorStop();
    return;
  }

  digitalWrite(IN1, LOW);
  digitalWrite(IN2, HIGH);
  digitalWrite(IN3, LOW);
  digitalWrite(IN4, HIGH);

  lastMotorCommandMs = millis();
  motorActive = true;
  motorState = "backward";
}

void motorLeft() {
  if (currentMode == MODE_ESTOP) {
    motorStop();
    return;
  }

  digitalWrite(IN1, LOW);
  digitalWrite(IN2, HIGH);
  digitalWrite(IN3, HIGH);
  digitalWrite(IN4, LOW);

  lastMotorCommandMs = millis();
  motorActive = true;
  motorState = "left";
}

void motorRight() {
  if (currentMode == MODE_ESTOP) {
    motorStop();
    return;
  }

  digitalWrite(IN1, HIGH);
  digitalWrite(IN2, LOW);
  digitalWrite(IN3, LOW);
  digitalWrite(IN4, HIGH);

  lastMotorCommandMs = millis();
  motorActive = true;
  motorState = "right";
}

void applyMotorCommand(const String &cmd, uint32_t seq = 0, unsigned long ttlMs = 700) {
  if (seq > 0) lastCmdSeq = seq;
  currentCommandTtlMs = constrain(ttlMs, 100UL, 3000UL);

  if (cmd == "forward") motorForward();
  else if (cmd == "backward") motorBackward();
  else if (cmd == "left") motorLeft();
  else if (cmd == "right") motorRight();
  else motorStop();
}

void applyDifferentialDrive(float left, float right, uint32_t seq, unsigned long ttlMs) {
  if (seq > 0) lastCmdSeq = seq;
  currentCommandTtlMs = constrain(ttlMs, 100UL, 3000UL);

  const float deadband = 0.08;

  if (fabs(left) < deadband && fabs(right) < deadband) {
    motorStop();
    return;
  }

  // This v1 firmware assumes L298N ENA/ENB jumpers are installed.
  // Therefore left/right speed is converted into direction only.
  // For true proportional speed, wire ENA/ENB to PWM-capable GPIO pins.
  if (left > deadband && right > deadband) {
    motorForward();
  } else if (left < -deadband && right < -deadband) {
    motorBackward();
  } else if (left < right) {
    motorLeft();
  } else if (left > right) {
    motorRight();
  } else {
    motorStop();
  }
}

// ================= SERVO =================
void setupServoPwm() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(SERVO_PIN, SERVO_FREQ, SERVO_RES);
#else
  ledcSetup(SERVO_CH, SERVO_FREQ, SERVO_RES);
  ledcAttachPin(SERVO_PIN, SERVO_CH);
#endif
}

void servoWriteAngle(int angle) {
  angle = constrain(angle, 0, 180);
  servoAngle = angle;

  const int minUs = 500;
  const int maxUs = 2500;
  int pulseUs = map(angle, 0, 180, minUs, maxUs);

  uint32_t maxDuty = (1UL << SERVO_RES) - 1;
  uint32_t duty = (uint32_t)((pulseUs / 20000.0) * maxDuty);

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(SERVO_PIN, duty);
#else
  ledcWrite(SERVO_CH, duty);
#endif
}

// ================= CONFIG =================
void loadDeviceConfig() {
  prefs.begin("visionbot", true);

  cfg.robotId = prefs.getString("robot_id", deviceId);
  if (cfg.robotId.length() == 0) cfg.robotId = deviceId;

  cfg.baseTopic = prefs.getString("base_topic", "visionbot");
  cfg.mqttHost = prefs.getString("mqtt_host", "");
  cfg.mqttPort = prefs.getUShort("mqtt_port", 1883);
  cfg.mqttUser = prefs.getString("mqtt_user", "");
  cfg.mqttPass = prefs.getString("mqtt_pass", "");
  cfg.telemetryIntervalMs = prefs.getUInt("telemetry_ms", 5000);

  prefs.end();

#if VISIONBOT_DEMO_WIFI_ENABLE
  cfg.baseTopic = "visionbot";
  cfg.mqttHost = VISIONBOT_DEMO_MQTT_HOST;
  cfg.mqttPort = VISIONBOT_DEMO_MQTT_PORT;
  cfg.mqttUser = "";
  cfg.mqttPass = "";
#endif

  cfg.telemetryIntervalMs = constrain(cfg.telemetryIntervalMs, 1000UL, 60000UL);
}

void saveDeviceConfig(
  const char *robotId,
  const char *baseTopic,
  const char *mqttHost,
  const char *mqttPort,
  const char *mqttUser,
  const char *mqttPass,
  const char *telemetryMs
) {
  prefs.begin("visionbot", false);

  prefs.putString("robot_id", String(robotId));
  prefs.putString("base_topic", String(baseTopic));
  prefs.putString("mqtt_host", String(mqttHost));
  prefs.putUShort("mqtt_port", (uint16_t)atoi(mqttPort));
  prefs.putString("mqtt_user", String(mqttUser));
  prefs.putString("mqtt_pass", String(mqttPass));
  prefs.putUInt("telemetry_ms", (uint32_t)atol(telemetryMs));

  prefs.end();

  loadDeviceConfig();
}

void resetAllConfigAndRestart() {
  motorStop();

  prefs.begin("visionbot", false);
  prefs.clear();
  prefs.end();

  WiFi.disconnect(true, true);

  delay(500);
  ESP.restart();
}

String getRecoveryPortalReason() {
  prefs.begin("visionbot", true);
  String reason = prefs.getString("portal_reason", "");
  prefs.end();
  return reason;
}

void setRecoveryPortalReason(const String &reason) {
  prefs.begin("visionbot", false);
  prefs.putString("portal_reason", reason);
  prefs.end();
}

