minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32S3_CAM_MQTT1883/VisionBot_ESP32S3_CAM_MQTT1883.ino
void publishState(bool retain = true) {
  if (!mqttClient.connected()) return;
  String p = makeStatePayload(true);
  mqttClient.publish(mqttTopic("state").c_str(), p.c_str(), retain);
}

void publishTelemetry() {
  if (!mqttClient.connected()) return;
  String p = makeTelemetryPayload();
  mqttClient.publish(mqttTopic("telemetry").c_str(), p.c_str(), false);
}

void publishCmdAck(const String &command, uint32_t seq, const String &status, const String &detail) {
  lastCmdAckStatus = status;
  lastCmdAckDetail = detail;

  if (!mqttClient.connected()) return;

  String p = "{";
  p += "\"schema\":\"visionbot.cmd_ack.v1\",";
  p += "\"device_id\":" + q(deviceId) + ",";
  p += "\"robot_id\":" + q(cfg.robotId) + ",";
  p += "\"ts\":" + String(currentUnixTs()) + ",";
  p += "\"uptime_ms\":" + String(millis()) + ",";
  p += "\"seq\":" + String(seq) + ",";
  p += "\"command\":" + q(command) + ",";
  p += "\"status\":" + q(status) + ",";
  p += "\"detail\":" + q(detail) + ",";
  p += "\"mode\":" + q(modeToString()) + ",";
  p += "\"motor_state\":" + q(motorState) + ",";
  p += "\"motor_active\":" + boolStr(motorActive) + ",";
  p += "\"servo_angle\":" + String(servoAngle) + ",";
  p += "\"last_cmd_seq\":" + String(lastCmdSeq) + ",";
  p += "\"firmware\":" + q(String(FW_NAME) + "-" + FW_VERSION);
  p += "}";

  bool ok = mqttClient.publish(mqttTopic("cmd_ack").c_str(), p.c_str(), false);
  Serial.println("[MQTT ACK] " + command + " seq=" + String(seq) + " status=" + status + " publish=" + String(ok ? "ok" : "failed"));
}

void handleMqttDriveCommand(const String &payload) {
  StaticJsonDocument<512> doc;
  DeserializationError err = deserializeJson(doc, payload);

  if (err) {
    publishCmdAck("drive", 0, "error", "invalid_json");
    publishSecurityEvent("invalid_drive_payload", payload, "warn");
    return;
  }

  uint32_t seq = doc["seq"] | 0;
  unsigned long ttlMs = doc["ttl_ms"] | 300;

  if (currentMode == MODE_ESTOP) {
    motorStop();
    publishCmdAck("drive", seq, "rejected", "mode_estop");
    publishSecurityEvent("drive_rejected_estop", "drive command rejected because mode=estop", "warn");
    publishTelemetry();
    return;
  }

  if (doc["mode"].is<const char*>()) {
    String requestedMode = String((const char*)doc["mode"]);
    if (requestedMode == "manual" || requestedMode == "ai") {
      currentMode = requestedMode == "manual" ? MODE_MANUAL : MODE_AI;
    }
  }

  String detail = "";

  if (doc["cmd"].is<const char*>()) {
    String cmd = String((const char*)doc["cmd"]);
    if (!(cmd == "forward" || cmd == "backward" || cmd == "left" || cmd == "right" || cmd == "stop")) {
      motorStop();
      if (seq > 0) lastCmdSeq = seq;
      publishCmdAck("drive", seq, "rejected", "invalid_drive_cmd=" + cmd);
      publishSecurityEvent("drive_rejected_invalid_cmd", "cmd=" + cmd, "warn");
      publishTelemetry();
      return;
    }
    applyMotorCommand(cmd, seq, ttlMs);
    detail = "cmd=" + cmd + ",state=" + motorState;
  } else {
    float left = doc["left"] | 0.0;
    float right = doc["right"] | 0.0;
    applyDifferentialDrive(left, right, seq, ttlMs);
    detail = "left=" + String(left, 2) + ",right=" + String(right, 2) + ",state=" + motorState;
  }

  publishCmdAck("drive", seq, "executed", detail);
  publishSecurityEvent("cmd_drive", "executed seq=" + String(seq) + " state=" + motorState);
  publishTelemetry();
}

void handleMqttServoCommand(const String &payload) {
  StaticJsonDocument<256> doc;
  DeserializationError err = deserializeJson(doc, payload);

  if (err) {
    publishCmdAck("servo", 0, "error", "invalid_json");
    publishSecurityEvent("invalid_servo_payload", payload, "warn");
    return;
  }

  uint32_t seq = doc["seq"] | 0;
  int angle = doc["angle"] | servoAngle;

  if (angle < 0 || angle > 180) {
    if (seq > 0) lastCmdSeq = seq;
    publishCmdAck("servo", seq, "rejected", "angle_out_of_range=" + String(angle));
    publishSecurityEvent("servo_rejected_angle", "angle=" + String(angle), "warn");
    publishTelemetry();
    return;
  }

  if (seq > 0) lastCmdSeq = seq;

  servoWriteAngle(angle);

  publishCmdAck("servo", seq, "executed", "angle=" + String(servoAngle));
  publishSecurityEvent("cmd_servo", "servo angle=" + String(servoAngle));
  publishTelemetry();
}

void handleMqttStopCommand(const String &payload) {
  motorStop();
  currentMode = MODE_ESTOP;

  StaticJsonDocument<256> doc;
  DeserializationError err = deserializeJson(doc, payload);

  String reason = "stop_command";
  uint32_t seq = 0;

  if (!err) {
    reason = String((const char*)(doc["reason"] | "stop_command"));
    seq = doc["seq"] | 0;
  } else {
    reason = "invalid_json_but_estop_applied";
  }

  if (seq > 0) lastCmdSeq = seq;

  publishCmdAck("stop", seq, "executed", reason);
  publishSecurityEvent("cmd_stop", reason, "warn");
  publishTelemetry();
  publishState(true);
}

void handleMqttModeCommand(const String &payload) {
  StaticJsonDocument<256> doc;
  DeserializationError err = deserializeJson(doc, payload);

  if (err) {
    publishCmdAck("mode", 0, "error", "invalid_json");
    publishSecurityEvent("invalid_mode_payload", payload, "warn");
    return;
  }

  uint32_t seq = doc["seq"] | 0;
  String mode = String((const char*)(doc["mode"] | "idle"));

  if (!(mode == "idle" || mode == "manual" || mode == "ai" || mode == "estop")) {
    if (seq > 0) lastCmdSeq = seq;
    publishCmdAck("mode", seq, "rejected", "invalid_mode=" + mode);
    publishSecurityEvent("mode_rejected_invalid", "mode=" + mode, "warn");
    publishTelemetry();
    return;
  }

  if (seq > 0) lastCmdSeq = seq;

  if (mode == "idle") {
    motorStop();
    currentMode = MODE_IDLE;
  } else if (mode == "manual") {
    motorStop();
    currentMode = MODE_MANUAL;
  } else if (mode == "ai") {
    motorStop();
    currentMode = MODE_AI;
  } else if (mode == "estop") {
    motorStop();
    currentMode = MODE_ESTOP;
  }

  publishCmdAck("mode", seq, "executed", "mode=" + modeToString());
  publishSecurityEvent("cmd_mode", "mode=" + modeToString());
  publishTelemetry();
  publishState(true);
}

void mqttCallback(char *topicChars, byte *payloadBytes, unsigned int length) {
  String topic = String(topicChars);
  String payload;
  payload.reserve(length + 1);

  for (unsigned int i = 0; i < length; i++) {
    payload += (char)payloadBytes[i];
  }

  String driveTopic = mqttTopic("cmd/drive");
  String servoTopic = mqttTopic("cmd/servo");
  String stopTopic = mqttTopic("cmd/stop");
  String modeTopic = mqttTopic("cmd/mode");
  String resetTopic = mqttTopic("cmd/config/reset");

  if (topic == driveTopic) {
    handleMqttDriveCommand(payload);
  } else if (topic == servoTopic) {
    handleMqttServoCommand(payload);
  } else if (topic == stopTopic) {
    handleMqttStopCommand(payload);
  } else if (topic == modeTopic) {
    handleMqttModeCommand(payload);
  } else if (topic == resetTopic) {
    publishSecurityEvent("config_reset_requested", "MQTT reset command received", "warn");
    delay(500);
    resetAllConfigAndRestart();
  }
}

void setupMqttClient() {
  Serial.println("MQTT mode: plain TCP port 1883 for broker-first LAN demo.");
}

void mqttSubscribeCommands() {
  mqttClient.subscribe(mqttTopic("cmd/drive").c_str(), 1);
  mqttClient.subscribe(mqttTopic("cmd/servo").c_str(), 1);
  mqttClient.subscribe(mqttTopic("cmd/stop").c_str(), 1);
  mqttClient.subscribe(mqttTopic("cmd/mode").c_str(), 1);
  mqttClient.subscribe(mqttTopic("cmd/config/reset").c_str(), 1);
}


bool probeMqttTcpPort() {
  WiFiClient probeClient;
  probeClient.setTimeout(5000);

