minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32S3_CAM_MQTT1883/VisionBot_ESP32S3_CAM_MQTT1883.ino
  Serial.print("MQTT TCP probe ");
  Serial.print(cfg.mqttHost);
  Serial.print(":");
  Serial.print(cfg.mqttPort);
  Serial.print(" ... ");

  bool ok = probeClient.connect(cfg.mqttHost.c_str(), cfg.mqttPort);
  if (ok) {
    Serial.println("OK (broker port reachable from ESP32-S3-CAM)");
    probeClient.stop();
    delay(250);
    return true;
  }

  Serial.println("FAILED (ESP32-S3-CAM cannot reach broker TCP port)");
  probeClient.stop();
  return false;
}

bool connectMqtt() {
  if (cfg.mqttHost.length() == 0) {
    Serial.println("MQTT broker is not configured.");
    return false;
  }

  if (!probeMqttTcpPort()) {
    return false;
  }

  mqttClient.setServer(cfg.mqttHost.c_str(), cfg.mqttPort);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(2048);
  mqttClient.setKeepAlive(30);
  mqttClient.setSocketTimeout(12);

  String clientId = deviceId;
  String stateTopic = mqttTopic("state");
  String willPayload = makeStatePayload(false);

  Serial.print("Connecting MQTT ");
  Serial.print(cfg.mqttHost);
  Serial.print(":");
  Serial.print(cfg.mqttPort);
  Serial.print(" as ");
  Serial.println(clientId);

  bool ok;

  if (cfg.mqttUser.length() > 0) {
    ok = mqttClient.connect(
      clientId.c_str(),
      cfg.mqttUser.c_str(),
      cfg.mqttPass.c_str(),
      stateTopic.c_str(),
      1,
      true,
      willPayload.c_str()
    );
  } else {
    ok = mqttClient.connect(
      clientId.c_str(),
      nullptr,
      nullptr,
      stateTopic.c_str(),
      1,
      true,
      willPayload.c_str()
    );
  }

  if (!ok) {
    Serial.print("MQTT connect failed. state=");
    Serial.println(mqttClient.state());
    return false;
  }

  mqttEverConnected = true;
  mqttReconnectDelayMs = 1000;
  resetMqttFailureTracker();

  mqttSubscribeCommands();

  publishState(true);
  publishTelemetry();
  publishSecurityEvent("mqtt_connected", "connected and commands subscribed");

  Serial.println("MQTT connected.");
  Serial.println("Subscribed topics:");
  Serial.println("  " + mqttTopic("cmd/drive"));
  Serial.println("  " + mqttTopic("cmd/servo"));
  Serial.println("  " + mqttTopic("cmd/stop"));
  Serial.println("  " + mqttTopic("cmd/mode"));
  Serial.println("  " + mqttTopic("cmd/config/reset"));

  return true;
}

void maintainMqtt() {
  if (WiFi.status() != WL_CONNECTED) {
    if (motorActive) {
      motorStop();
    }
    return;
  }

  if (mqttClient.connected()) {
    mqttClient.loop();
    return;
  }

  if (mqttEverConnected) {
    motorStop();
  }

  unsigned long now = millis();
  if (now - lastMqttAttemptMs < mqttReconnectDelayMs) return;

  lastMqttAttemptMs = now;

  bool ok = connectMqtt();

  if (!ok) {
    recordMqttFailureAndKeepRunning();
    mqttReconnectDelayMs = min(mqttReconnectDelayMs * 2, MQTT_RECONNECT_MAX_MS);
  }
}

// ================= HTTP SERVER =================
String buildRootPayload() {
  String p = "{";
  p += "\"name\":\"VisionBot ESP32-S3-CAM\",";
  p += "\"device_id\":" + q(deviceId) + ",";
  p += "\"robot_id\":" + q(cfg.robotId) + ",";
  p += "\"firmware\":" + q(String(FW_NAME) + "-" + FW_VERSION) + ",";
  p += "\"runtime\":\"headless\",";
  p += "\"message\":\"This device exposes JSON APIs and WebSocket camera stream only. Main UI must run on backend/frontend.\",";
  p += "\"health\":\"/api/health\",";
  p += "\"status\":\"/api/status\",";
  p += "\"state\":\"/api/state\",";
  p += "\"stream_url\":" + q(getStreamUrl()) + ",";
  p += "\"mqtt_state_topic\":" + q(mqttTopic("state"));
  p += "}";
  return p;
}

void handleRoot() {
  httpServer.send(200, "application/json", buildRootPayload());
}

void handleHealth() {
  String p = "{";
  p += "\"ok\":true,";
  p += "\"device_id\":" + q(deviceId) + ",";
  p += "\"uptime_ms\":" + String(millis()) + ",";
  p += "\"wifi_connected\":" + boolStr(WiFi.status() == WL_CONNECTED) + ",";
  p += "\"mqtt_connected\":" + boolStr(mqttClient.connected()) + ",";
  p += "\"camera_ready\":" + boolStr(cameraReady);
  p += "}";
  httpServer.send(200, "application/json", p);
}

void handleStatus() {
  httpServer.send(200, "application/json", makeTelemetryPayload());
}

void handleState() {
  httpServer.send(200, "application/json", makeStatePayload(true));
}

void handleStop() {
  motorStop();
  currentMode = MODE_ESTOP;
  publishSecurityEvent("http_stop", "local HTTP stop endpoint called", "warn");
  publishState(true);
  httpServer.send(200, "application/json", "{\"ok\":true,\"mode\":\"estop\",\"motor_state\":\"stop\"}");
}

void handleConfigReset() {
  String token = httpServer.arg("token");

  if (token != setupApPass) {
    publishSecurityEvent("config_reset_denied", "invalid local reset token", "warn");
    httpServer.send(403, "application/json", "{\"ok\":false,\"error\":\"invalid_token\"}");
    return;
  }

  publishSecurityEvent("config_reset_http", "local HTTP config reset", "warn");
  httpServer.send(200, "application/json", "{\"ok\":true,\"message\":\"resetting\"}");
  delay(500);
  resetAllConfigAndRestart();
}

void handleDebugMotor() {
  String cmd = httpServer.arg("cmd");
  applyMotorCommand(cmd, 0, 700);
  publishSecurityEvent("http_debug_motor", "cmd=" + cmd, "warn");
  httpServer.send(200, "application/json", "{\"ok\":true,\"cmd\":" + q(cmd) + ",\"motor_state\":" + q(motorState) + "}");
}

void handleDebugServo() {
  int angle = httpServer.arg("angle").toInt();
  servoWriteAngle(angle);
  publishSecurityEvent("http_debug_servo", "angle=" + String(servoAngle), "warn");
  httpServer.send(200, "application/json", "{\"ok\":true,\"servo_angle\":" + String(servoAngle) + "}");
}

void setupHttpServer() {
  httpServer.on("/", HTTP_GET, handleRoot);
  httpServer.on("/api/health", HTTP_GET, handleHealth);
  httpServer.on("/api/status", HTTP_GET, handleStatus);
  httpServer.on("/api/state", HTTP_GET, handleState);

  // Emergency stop is intentionally kept as a local HTTP endpoint.
  // Normal control should use MQTT through the backend.
  httpServer.on("/api/stop", HTTP_POST, handleStop);

  // Reset requires token shown in Serial Monitor as setup AP password.
  httpServer.on("/api/config/reset", HTTP_POST, handleConfigReset);

  httpServer.onNotFound([]() {
    httpServer.send(404, "application/json", "{\"ok\":false,\"error\":\"not_found\"}");
  });

  httpServer.begin();
  Serial.println("Headless HTTP API started on port 80.");
}

// ================= SERIAL FALLBACK =================
void handleSerialCommand(char c) {
  if (c == 'f') {
    currentMode = MODE_MANUAL;
    applyMotorCommand("forward");
  } else if (c == 'b') {
    currentMode = MODE_MANUAL;
    applyMotorCommand("backward");
  } else if (c == 'l') {
    currentMode = MODE_MANUAL;
    applyMotorCommand("left");
  } else if (c == 'r') {
    currentMode = MODE_MANUAL;
    applyMotorCommand("right");
  } else if (c == 's') {
    motorStop();
    currentMode = MODE_IDLE;
  } else if (c == 'e') {
    motorStop();
    currentMode = MODE_ESTOP;
  } else if (c == '0') {
    servoWriteAngle(0);
  } else if (c == '1') {
    servoWriteAngle(90);
  } else if (c == '2') {
    servoWriteAngle(180);
  } else if (c == 'x') {
    Serial.println("Serial config reset requested.");
    resetAllConfigAndRestart();
  } else if (c == '?') {
    Serial.println(makeTelemetryPayload());
  }
}

// ================= SETUP / LOOP =================
void setupPins() {
  pinMode(IN1, OUTPUT);
  pinMode(IN2, OUTPUT);
  pinMode(IN3, OUTPUT);
  pinMode(IN4, OUTPUT);
  motorStop();

  setupServoPwm();
  servoWriteAngle(90);
}

void printBootInfo() {
  Serial.println();
  Serial.println("======================================");
  Serial.println(" VisionBot ESP32-S3-CAM Firmware v1.3.2 MQTT 1883 No Reset");
  Serial.println("======================================");
  Serial.print("Device ID: ");
  Serial.println(deviceId);
  Serial.print("Robot ID: ");
  Serial.println(cfg.robotId);
  Serial.print("Firmware: ");
  Serial.print(FW_NAME);
  Serial.print("-");
  Serial.println(FW_VERSION);
  Serial.print("Reset reason: ");
  Serial.println(resetReasonToString());
  Serial.println();
}

void setup() {
  bootMs = millis();

